# Welcome to Jupyter Notebook for Pandas

In [1]:
import numpy as np
import pandas as pd

## Quick Overview:-

In [2]:
dict1 = {
    "Name":['Ayush', 'Maanit', 'Jaimit', 'Shrey'],
    "Marks":[25, 23, 22, 24],
    "City":['Ahmedabad', 'Delhi', 'Hyedrabad', 'Chicago']
}

In [3]:
df = pd.DataFrame(dict1) # It will make a data frame of this, like an excell sheet

In [4]:
df

     Name  Marks       City
0   Ayush     25  Ahmedabad
1  Maanit     23      Delhi
2  Jaimit     22  Hyedrabad
3   Shrey     24    Chicago

In [5]:
df.to_csv('Friends.csv') # This will export the dictionary to an excel sheet, you'll get this in your folder

In [6]:
df.to_csv('Friends_WithoutIndexes.csv', index=False) # This will not print the indexes of elements in the csv file

In [7]:
df.head(2) # This will only show 2 rows from up

     Name  Marks       City
0   Ayush     25  Ahmedabad
1  Maanit     23      Delhi

In [8]:
df.tail(2) # This will only show 2 rows from down

     Name  Marks       City
2  Jaimit     22  Hyedrabad
3   Shrey     24    Chicago

In [9]:
df.describe() # This will show statistics about the numeric columns, like count, mean, minimum, maximum, etc.

           Marks
count   4.000000
mean   23.500000
std     1.290994
min    22.000000
25%    22.750000
50%    23.500000
75%    24.250000
max    25.000000

In [10]:
readCSV = pd.read_csv('Friends.csv') # This will open any csv file and read it here, you can also read a file made in the folder
                                     # in the device

In [11]:
readCSV # In this, it is adding index numbers one more time

   Unnamed: 0    Name  Marks       City
0           0   Ayush     25  Ahmedabad
1           1  Maanit     23      Delhi
2           2  Jaimit     22  Hyedrabad
3           3   Shrey     24    Chicago

In [12]:
readCSV_withoutIndex = pd.read_csv('Friends_WithoutIndexes.csv') # If we write the same name of the csv file as the name in the
                                                                 # folder, it will overwrite the file

In [13]:
readCSV_withoutIndex

     Name  Marks       City
0   Ayush     25  Ahmedabad
1  Maanit     23      Delhi
2  Jaimit     22  Hyedrabad
3   Shrey     24    Chicago

In [14]:
readCSV['Marks'] # This will just give info of one column

0    25
1    23
2    22
3    24
Name: Marks, dtype: int64

In [15]:
readCSV['Marks'][3] # With Index

24

In [16]:
readCSV['Marks'][3] = 23   # This will change the value at that index, the warning will say that this is not a good method to 
                           # change the value, but it will work

<ipython-input-16-9556d9dd1d34>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  readCSV['Marks'][3] = 23   # This will change the value at that index, the warning will say that this is not a good method to

In [17]:
readCSV # The value is changed

   Unnamed: 0    Name  Marks       City
0           0   Ayush     25  Ahmedabad
1           1  Maanit     23      Delhi
2           2  Jaimit     22  Hyedrabad
3           3   Shrey     23    Chicago

In [18]:
readCSV.index = ['one', 'two', 'three', 'four'] # This will change the index names

In [19]:
readCSV

       Unnamed: 0    Name  Marks       City
one             0   Ayush     25  Ahmedabad
two             1  Maanit     23      Delhi
three           2  Jaimit     22  Hyedrabad
four            3   Shrey     23    Chicago

## In depth of Pandas:-

##### Series - It's a one dimensional arrat with indexes, it stores a single column or row of a similar type of data in a Dataframe
##### Dataframe - It's a tabular spreadsheet like structure representing rows each of which contains one or more columns

In [20]:
ser = pd.Series(np.random.rand(34))

In [21]:
ser

0     0.102862
1     0.203018
2     0.398786
3     0.849372
4     0.281562
5     0.884777
6     0.638849
7     0.348357
8     0.751115
9     0.366289
10    0.715708
11    0.937307
12    0.067403
13    0.917728
14    0.941262
15    0.568376
16    0.364722
17    0.745244
18    0.033716
19    0.625772
20    0.004951
21    0.921409
22    0.304587
23    0.226923
24    0.472555
25    0.645787
26    0.991746
27    0.818910
28    0.191303
29    0.172000
30    0.582288
31    0.449906
32    0.744565
33    0.871311
dtype: float64

In [22]:
type(ser)    # It is a series

pandas.core.series.Series

In [23]:
newdf = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334)) # 334 rows and 5 columns

In [24]:
newdf.head()

          0         1         2         3         4
0  0.125482  0.098898  0.799468  0.445330  0.125610
1  0.196192  0.257675  0.466249  0.370161  0.216306
2  0.939180  0.854923  0.747695  0.284269  0.593235
3  0.720312  0.095186  0.469506  0.764790  0.824789
4  0.814585  0.167799  0.226230  0.310206  0.776482

In [25]:
type(newdf)

pandas.core.frame.DataFrame

In [26]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
newdf[0][0] = "String"

In [28]:
newdf.dtypes # Now, the data type of the first column is object because a string is there

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [29]:
newdf.head(2)

          0         1         2         3         4
0    String  0.098898  0.799468  0.445330  0.125610
1  0.196192  0.257675  0.466249  0.370161  0.216306

In [30]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [31]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [32]:
newdf[0][0] = 0.3 # Again a warning will come

<ipython-input-32-fa16b7a98942>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0] = 0.3 # Again a warning will come

In [33]:
# To Convert the Dataframe to numpy Array:
newdf.to_numpy()

array([[0.3, 0.09889777094372965, 0.7994682317397349,
        0.44532967855152483, 0.12561035910525775],
       [0.19619214391587592, 0.2576751610315231, 0.46624903831784703,
        0.37016059562063364, 0.2163057730202942],
       [0.9391802106906854, 0.8549233945948208, 0.7476954466174024,
        0.2842685568946104, 0.593234915439808],
       ...,
       [0.3231038130259535, 0.6994477442503936, 0.03772224673866531,
        0.1899457560088833, 0.6062094084564607],
       [0.5951403390354731, 0.8291819986214156, 0.10399411777151712,
        0.25359736955073, 0.7966113928564525],
       [0.8967593154940328, 0.8068803759579496, 0.5368064710361585,
        0.9582114599084008, 0.8305675423305237]], dtype=object)

In [34]:
newdf.T # Its Transpose will happen, now it will be 5 rows by 334 columns

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.196192,0.93918,0.720312,0.814585,0.997832,0.793365,0.491996,0.325547,0.805782,...,0.186652,0.159024,0.0614061,0.239365,0.97905,0.00528551,0.516978,0.323104,0.59514,0.896759
1,0.0988978,0.257675,0.854923,0.0951862,0.167799,0.854612,0.472106,0.922951,0.681585,0.677104,...,0.950958,0.710382,0.65273,0.433811,0.865135,0.162951,0.722828,0.699448,0.829182,0.80688
2,0.799468,0.466249,0.747695,0.469506,0.22623,0.124824,0.278886,0.846969,0.585608,0.606982,...,0.537422,0.467881,0.26455,0.426601,0.715997,0.0246612,0.55667,0.0377222,0.103994,0.536806
3,0.44533,0.370161,0.284269,0.76479,0.310206,0.474593,0.717241,0.360098,0.678848,0.842723,...,0.16014,0.707575,0.306984,0.286161,0.415319,0.784161,0.921744,0.189946,0.253597,0.958211
4,0.12561,0.216306,0.593235,0.824789,0.776482,0.808553,0.675286,0.694116,0.543631,0.181878,...,0.637587,0.895405,0.929692,0.814986,0.063919,0.812931,0.217997,0.606209,0.796611,0.830568

In [35]:
newdf.sort_index(axis=0, ascending=False) # axis=0 is rows, means we'll sort the rows, axis=1 is columns

              0         1         2         3         4
333    0.896759  0.806880  0.536806  0.958211  0.830568
332     0.59514  0.829182  0.103994  0.253597  0.796611
331    0.323104  0.699448  0.037722  0.189946  0.606209
330    0.516978  0.722828  0.556670  0.921744  0.217997
329  0.00528551  0.162951  0.024661  0.784161  0.812931
..          ...       ...       ...       ...       ...
4      0.814585  0.167799  0.226230  0.310206  0.776482
3      0.720312  0.095186  0.469506  0.764790  0.824789
2       0.93918  0.854923  0.747695  0.284269  0.593235
1      0.196192  0.257675  0.466249  0.370161  0.216306
0           0.3  0.098898  0.799468  0.445330  0.125610

[334 rows x 5 columns]

In [36]:
newdf[0].head(2) # This will give the column

0         0.3
1    0.196192
Name: 0, dtype: object

In [37]:
type(newdf[0])

pandas.core.series.Series

##### View and copy:-

In [38]:
newdf2 = newdf

In [39]:
newdf2[0][0] = 9783 # Again Copy and View Warning will come

<ipython-input-39-97a2bc5425ae>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 9783 # Again Copy and View Warning will come

In [40]:
newdf.head() # newdf is also changed but we had changed newdf2

          0         1         2         3         4
0      9783  0.098898  0.799468  0.445330  0.125610
1  0.196192  0.257675  0.466249  0.370161  0.216306
2   0.93918  0.854923  0.747695  0.284269  0.593235
3  0.720312  0.095186  0.469506  0.764790  0.824789
4  0.814585  0.167799  0.226230  0.310206  0.776482

This happened because newdf2 is just a view of newdf, it is like a pointer

If we change by copy method,

In [41]:
newdf2 = newdf.copy()

In [42]:
newdf2[0][1] = 123.321

<ipython-input-42-97cad0b75b9c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][1] = 123.321

In [43]:
newdf.head(2)  # Now it is not changes

          0         1         2         3         4
0      9783  0.098898  0.799468  0.445330  0.125610
1  0.196192  0.257675  0.466249  0.370161  0.216306

In [44]:
newdf2.head(2) # It has changed only here

         0         1         2         3         4
0     9783  0.098898  0.799468  0.445330  0.125610
1  123.321  0.257675  0.466249  0.370161  0.216306

To avoid the warning while setting a value, we donot set it like this

##### loc function:-

We set the value like this:-

In [45]:
newdf.loc[0, 0] = 654

In [46]:
newdf.head(1) # The value has been changed

     0         1         2        3        4
0  654  0.098898  0.799468  0.44533  0.12561

In [47]:
newdf.columns = list("ABCDE")

In [48]:
newdf.head(1)

     A         B         C        D        E
0  654  0.098898  0.799468  0.44533  0.12561

In [49]:
# newdf.loc[0, 0] = 123 # This will add a new column '0' at the end
newdf.loc[0, 'B'] = 123

In [50]:
newdf.head(1)

     A      B         C        D        E
0  654  123.0  0.799468  0.44533  0.12561

In [51]:
newdf.drop('E', axis=1) # Default axis is 0, so a row would be removed
# This function is used to remove a column or row
# newdf = newdf.drop('E', axis=1)  # This will really change the newdf

              A           B         C         D
0           654  123.000000  0.799468  0.445330
1      0.196192    0.257675  0.466249  0.370161
2       0.93918    0.854923  0.747695  0.284269
3      0.720312    0.095186  0.469506  0.764790
4      0.814585    0.167799  0.226230  0.310206
..          ...         ...       ...       ...
329  0.00528551    0.162951  0.024661  0.784161
330    0.516978    0.722828  0.556670  0.921744
331    0.323104    0.699448  0.037722  0.189946
332     0.59514    0.829182  0.103994  0.253597
333    0.896759    0.806880  0.536806  0.958211

[334 rows x 4 columns]

In [52]:
# To get only a set of rows and columns:
newdf.loc[[1, 2], ['C', 'D']]

          C         D
1  0.466249  0.370161
2  0.747695  0.284269

In [53]:
newdf.loc[:, ['C', 'D']] # This will give all rows but two columns

            C         D
0    0.799468  0.445330
1    0.466249  0.370161
2    0.747695  0.284269
3    0.469506  0.764790
4    0.226230  0.310206
..        ...       ...
329  0.024661  0.784161
330  0.556670  0.921744
331  0.037722  0.189946
332  0.103994  0.253597
333  0.536806  0.958211

[334 rows x 2 columns]

In [54]:
newdf.loc[[1, 2], :] # This will give all columns but only these rows

          A         B         C         D         E
1  0.196192  0.257675  0.466249  0.370161  0.216306
2   0.93918  0.854923  0.747695  0.284269  0.593235

In [55]:
newdf.loc[(newdf['A']<0.3)] # It will display only those rows where the value in the column A will be less than 0.3

              A         B         C         D         E
1      0.196192  0.257675  0.466249  0.370161  0.216306
16     0.222269  0.688945  0.604013  0.035000  0.849866
21     0.100378  0.195051  0.759510  0.575367  0.814817
22     0.169351  0.581578  0.360512  0.767378  0.076582
36     0.238138  0.762544  0.859564  0.565792  0.701636
..          ...       ...       ...       ...       ...
324    0.186652  0.950958  0.537422  0.160140  0.637587
325    0.159024  0.710382  0.467881  0.707575  0.895405
326   0.0614061  0.652730  0.264550  0.306984  0.929692
327    0.239365  0.433811  0.426601  0.286161  0.814986
329  0.00528551  0.162951  0.024661  0.784161  0.812931

[96 rows x 5 columns]

In [56]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.3)] # Adding another query

             A         B         C         D         E
1     0.196192  0.257675  0.466249  0.370161  0.216306
16    0.222269  0.688945  0.604013  0.035000  0.849866
21    0.100378  0.195051  0.759510  0.575367  0.814817
22    0.169351  0.581578  0.360512  0.767378  0.076582
36    0.238138  0.762544  0.859564  0.565792  0.701636
38     0.06885  0.106326  0.349079  0.913138  0.028705
41    0.282344  0.798042  0.847716  0.664045  0.499224
55    0.225009  0.860971  0.773826  0.666267  0.149620
56   0.0539964  0.823970  0.953990  0.537973  0.843636
63    0.174398  0.596076  0.732846  0.865938  0.269417
65      0.1604  0.482521  0.972380  0.148836  0.387985
67     0.16216  0.243146  0.904122  0.878889  0.700780
68    0.246284  0.750794  0.814211  0.754097  0.042858
70    0.177607  0.397105  0.965603  0.475236  0.598974
84    0.203546  0.513586  0.355375  0.940664  0.275540
86    0.299799  0.124531  0.398362  0.938341  0.488499
87    0.160865  0.586201  0.386159  0.211235  0.735575
98    0.067304  0.965133  0.851376  0.325834  0.350703
101  0.0723127  0.541203  0.651526  0.210621  0.144013
104   0.216122  0.867028  0.889122  0.254957  0.919245
106   0.114452  0.335325  0.731984  0.384189  0.556571
115   0.191945  0.800423  0.436410  0.388874  0.218015
117   0.226969  0.134400  0.833023  0.237457  0.755763
124  0.0867839  0.124997  0.410302  0.642810  0.084795
127  0.0361012  0.528953  0.878342  0.141776  0.358296
140   0.113412  0.614810  0.844418  0.763514  0.603131
156  0.0833276  0.557219  0.872636  0.287266  0.540422
160   0.118874  0.642945  0.602610  0.005895  0.574870
171   0.290847  0.138440  0.525093  0.573727  0.905442
180   0.205534  0.202724  0.764461  0.244557  0.735603
183   0.146617  0.933943  0.995431  0.423216  0.268838
186  0.0209368  0.485017  0.904810  0.085734  0.835195
187   0.290734  0.357566  0.366200  0.627779  0.176940
194   0.120455  0.587694  0.377909  0.986038  0.791706
202   0.229704  0.261530  0.867599  0.275471  0.478492
204   0.204185  0.963101  0.996509  0.063464  0.528735
211   0.109614  0.980815  0.330362  0.794950  0.679267
216   0.221323  0.488142  0.657151  0.555878  0.395259
220   0.146276  0.652330  0.925734  0.910577  0.343650
223   0.291803  0.081826  0.535380  0.978446  0.017553
230   0.218966  0.588561  0.906375  0.382788  0.926415
232   0.265477  0.765101  0.704462  0.240738  0.239764
236   0.256761  0.552137  0.502543  0.446721  0.702435
245   0.293129  0.465821  0.361149  0.225260  0.275836
246   0.279256  0.998694  0.889554  0.153609  0.886336
250  0.0906612  0.541473  0.431478  0.783730  0.363383
258   0.176765  0.699932  0.586137  0.606263  0.328591
264   0.104935  0.520964  0.939961  0.010062  0.592060
276    0.17972  0.195909  0.717352  0.552850  0.939845
279   0.191432  0.065336  0.441234  0.908817  0.034188
293   0.171258  0.780099  0.336430  0.863380  0.363412
296   0.146439  0.827548  0.321057  0.059617  0.775904
304  0.0988205  0.342338  0.785154  0.901390  0.274042
310  0.0904221  0.715030  0.600213  0.819642  0.108866
324   0.186652  0.950958  0.537422  0.160140  0.637587
325   0.159024  0.710382  0.467881  0.707575  0.895405
327   0.239365  0.433811  0.426601  0.286161  0.814986

##### iloc function:-

In [57]:
newdf.head(2)

          A           B         C         D         E
0       654  123.000000  0.799468  0.445330  0.125610
1  0.196192    0.257675  0.466249  0.370161  0.216306

In [58]:
newdf.iloc[0, 4] # Used to count through index and not the name of the column or row

0.12561035910525775

In [59]:
newdf.iloc[[0, 5], [1, 2]]

            B         C
0  123.000000  0.799468
5    0.854612  0.124824

In [60]:
newdf.drop(['A', 'D'], axis=1) # This will not change the real dataframe
# newdf.drop(['A', 'D'], axis=1, inplace=True) # But this will change it

              B         C         E
0    123.000000  0.799468  0.125610
1      0.257675  0.466249  0.216306
2      0.854923  0.747695  0.593235
3      0.095186  0.469506  0.824789
4      0.167799  0.226230  0.776482
..          ...       ...       ...
329    0.162951  0.024661  0.812931
330    0.722828  0.556670  0.217997
331    0.699448  0.037722  0.606209
332    0.829182  0.103994  0.796611
333    0.806880  0.536806  0.830568

[334 rows x 3 columns]

In [61]:
newdf.drop([5, 7], axis=0, inplace=True)

In [62]:
newdf.head(8)

          A           B         C         D         E
0       654  123.000000  0.799468  0.445330  0.125610
1  0.196192    0.257675  0.466249  0.370161  0.216306
2   0.93918    0.854923  0.747695  0.284269  0.593235
3  0.720312    0.095186  0.469506  0.764790  0.824789
4  0.814585    0.167799  0.226230  0.310206  0.776482
6  0.793365    0.472106  0.278886  0.717241  0.675286
8  0.325547    0.681585  0.585608  0.678848  0.543631
9  0.805782    0.677104  0.606982  0.842723  0.181878

In [63]:
# newdf.reset_index() # This will reset the indices, but this also adds a column index
# To remove that column,
newdf.reset_index(drop=True, inplace=True)

In [64]:
newdf['B'].isnull() # This will return a bullean whether a value is null or not

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [65]:
# newdf['B'] = None   # This not the good way to set the value
newdf.loc[:, ['B']] = None

In [66]:
newdf.head(3)

          A     B         C         D         E
0       654  None  0.799468  0.445330  0.125610
1  0.196192  None  0.466249  0.370161  0.216306
2   0.93918  None  0.747695  0.284269  0.593235

In [67]:
newdf['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

##### Some other functions:-

In [68]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                  "toy": [np.nan, 'Batmboile', 'Bullwhip'],
                  "born": [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})

In [69]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmboile 1940-04-25
2  Alfred   Bullwhip        NaT

In [70]:
df.dropna()

     name        toy       born
1  Batman  Batmboile 1940-04-25

In [71]:
df.dropna(how='all') # The row and column will not be removed till all values of that row/column is na
# For column, also give the axis

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmboile 1940-04-25
2  Alfred   Bullwhip        NaT

In [72]:
df.drop_duplicates(subset=['name']) # This does not take axis as an argument

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmboile 1940-04-25

In [73]:
df.drop_duplicates(subset=['name'], keep='first')

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmboile 1940-04-25

In [74]:
df.drop_duplicates(subset=['name'], keep='last')

     name        toy       born
1  Batman  Batmboile 1940-04-25
2  Alfred   Bullwhip        NaT

In [75]:
df.drop_duplicates(subset=['name'], keep=False)

     name        toy       born
1  Batman  Batmboile 1940-04-25

In [76]:
df.shape

(3, 3)

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [78]:
df['name'].value_counts(dropna=False)

Alfred    2
Batman    1
Name: name, dtype: int64

In [79]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

Statistics:-

In [80]:
df = pd.DataFrame({0:[1, 2, 3], 1:[4, 5, 6], 2:[7, 8, 9]})

In [81]:
df

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [82]:
df.mean()

0    2.0
1    5.0
2    8.0
dtype: float64

In [83]:
df.corr()

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0

In [84]:
df.count()

0    3
1    3
2    3
dtype: int64

In [85]:
df.max()

0    3
1    6
2    9
dtype: int64

In [86]:
df.min()

0    1
1    4
2    7
dtype: int64

In [87]:
df.median()

0    2.0
1    5.0
2    8.0
dtype: float64

In [88]:
df.std()

0    1.0
1    1.0
2    1.0
dtype: float64

### Reading Excel through Pandas:-

In [89]:
data = pd.read_excel('Data.xlsx', engine="openpyxl")

In [90]:
data

   Unnamed: 0   Names2  Markss2     Citys2
0           0    Ayush       25  Ahmedabad
1           1  Dhairya       23      Delhi
2           2   Jaimit       22  Hyedrabad
3           3    Shrey       24    Chicago

In [91]:
data = pd.read_excel('Data.xlsx', engine="openpyxl", sheet_name="Sheet2")

In [92]:
data

   Unnamed: 0   Names2  Markss2     Citys2
0           0    Ayush       25  Ahmedabad
1           1  Dhairya       23      Delhi
2           2   Jaimit       22  Hyedrabad
3           3    Shrey       24    Chicago

In [93]:
data.iloc[1,0] = "Dhairya"

In [94]:
data

  Unnamed: 0   Names2  Markss2     Citys2
0          0    Ayush       25  Ahmedabad
1    Dhairya  Dhairya       23      Delhi
2          2   Jaimit       22  Hyedrabad
3          3    Shrey       24    Chicago

In [95]:
data.to_excel('Data.xlsx', engine="openpyxl", sheet_name="Sheet2", index=False)